<?php
$translation->add("ru", array(
	'status-idle'=>'простаиваем',
	'status-sending'=>'рассылка',
	'status-pause'=>'пауза',
	'process-resume'=>'Возобновить',
	'process-pause'=>'Приостановить',
	'process-cancel'=>'Отменить',
	'settings-primary'=>'Основные',
	'settings-outservers'=>'Внешние сервера',
	'settings-security'=>'Безопасность',
	'settings-diagnostics'=>'Самодиагностика',
	'settings-history-length'=>'Длина истории отправки',
	'settings-outservers-doc'=>'Подробное описание работы с внешнеми серверами смотрите в <a href="http://mailer.a-l-e-x-u-s.ru/docs/alexusMailer_v1.7.ru.pdf"><span class="label label-warning">документации</span></a>',
	'settings-outservers-check'=>'Проверить сервера',
	'settings-outservers-check-autoremove'=>'(недоступные будут автоматически удалены из списка)',
	'settings-outservers-check-log'=>'Лог проверки:',
	'settings-security-notwritable'=>' Отсутствует доступ на запись к скрипту! Смена пароля невозможна. <b>Измените права на 666</b> на время смены пароля.',
	'settings-security-notwritable-dir'=>' Отсутствует доступ на запись к папке! Сохранение настроек невозможно. <b>Измените права на 666</b> на время сохранения настроек.',
	'settings-security-password-changed'=>'Пароль успешно изменен!',
	'settings-security-password-not-changed'=>'При изменении пароля произошла ошибка, возможно файл скрипта недоступен на запись.',
	'settings-security-set-password'=>'Установить пароль',
	'settings-security-remove-password'=>'Удалить пароль',
	'settings-security-use-proxy'=>'Использовать http прокси',
	'settings-remove'=>'Удалить настройки',
	'settings-saved'=>'Настройки сохранены',
	'settings-save-error'=>'Ошибка сохранения настроек. Проверьте права на папку и файл amsettings.php',
	'outservers-not-available'=>'Работа с внешними серерами недоступна (смотрите Диагностику)',
	'send-in-background-notavalable'=>'Фоновая отправка не доступна (смотрите Диагностику)',
	'settings-removed'=>'Настройки удалены',
	'settings-send-in-background'=>'Отправлять в фоновом режиме',
	'main'=>'Главная',
	'help'=>'Помощь',
	'login'=>'Логин',
	'password'=>'Пароль',
	'settings'=>'Настройки',
	'name'=>'йаПосылалка',
	'title_service'=>'Сервис анонимной отправки почты с подменой адреса',
	'need_auth'=>'Для доступа необходима авторизация.',
	'wronglogpas'=>'Неправильный логин или пароль.',
	'sendedto'=>'Отправлено на ',
	'badcaptcha'=>'Неправильная captcha',
	'sendlimit'=>'Лимит отправок 1 в час',
	'sendavailable'=>'Отправка доступна',
	'sendlessminute'=>'Отправка менее чем через минуту',
	'sendafter'=>'Отправка через ',
	'sendafter2'=>' минут',
	'attachfile'=>'Прикрепление файла',
	'close'=>'Закрыть',
	'upload'=>'Загрузить',
	'uploadlist'=>'Загрузка списка',
	'uploadtemplate'=>'Загрузка шаблона',
	'preview'=>'Предпросмотр',
	'donatedevelopment'=>'Спонсировать разработку',
	'techsupport'=>'Техническая поддержка',
	'settings'=>'Настройки',
	'threadsnum'=>'Количество потоков:',
	'timeoutlen'=>'Задржка в секундах:',
	'useoutservers'=>'Использовать внешние серверы для отправки',
	'unavalable_in_service'=>'недоступно в режиме сервиса',
	'less'=>'Меньше',
	'more'=>'Больше',
	'delete'=>'Удалить',
	'status'=>'Статус',
	'recipient'=>'Кому',
	'fromname'=>'От кого, имя',
	'frommail'=>'От кого, адрес email',
	'replymail'=>'Адрес ответа, email',
	'subject'=>'Тема',
	'subject_example'=>'выращивание бамбука под кроватью',
	'addfield'=>'Дополнительное поле',
	'addfield2'=>'доп. поле',
	'mailtype'=>'Тип письма',
	'plaintext'=>'обычный текст',
	'withformating'=>'с форматированием',
	'htmle'=>'html с переносом картинок в аттач',
	'captcha'=>'Проверочный код',
	'save'=>'Сохранить',
	'load'=>'Загрузить',
	'send'=>'Отправить',
	'backtoeditor'=>'Вернуться к редактированию',
	'servicemode-not-available'=>'не доступно в демонстрационном режиме',
	'servicemode-macro-not-available'=>'ЭТО МАКРОС НЕ ДОСТУПЕН В ДЕМОНСТРАЦИОННОМ РЕЖИМЕ',
	'timezone'=>'Временная зона',
	'error'=>'ошибка',
	'service-warning-text'=>'ОТПРАВЛЕНО ЧЕРЕЗ ДЕМОНСТРАЦИОННЫЙ СЕРВИС йаПосылалка - СКРИПТА С ПОДМЕНОЙ АДРЕСА ОТПРАВИТЕЛЯ',
	'wrong-out-server-type'=>'Неверный тип шелла',
	'remote-server-unavailable'=>'Шелл не отвечает',
	'file-not-available'=>'Файл не доступен',
	'shell-check-no-correct-type-definition'=>'Неверно указан формат шелла',
	'shell-check-404-not-found'=>'404 не найден',
	'shell-check-unknown-shell-type'=>'Неизвестный тип шелла',
	'shell-sheck-test-command-execution-failed'=>'Не удалось выполнить тестовую команду',

	'file_is_writable'=>'Права на запись (666 или 777) к скрипту',
	'file_is_writable_e'=>'Нужны для изменения пароля',
	'dir_is_writable'=>'Права на запись (666 или 777) к папке',
	'dir_is_writable_e'=>'Нужны для автосоздания файла настроек и файлов фоновой рассылки',
	'settings_is_writable'=>'Права на запись (666 или 777) в файл настроек amsettings.php',
	'settings_is_writable_e'=>'Необходимо для сохранения настроек',
	'bgfiles_is_writable'=>'Права на запись (666 или 777) к файлам фоновой рассылки - .state.am.php и .task.am.php',
	'bgfiles_is_writable_e'=>'Необходимо для использования фоновой рассылки',
	'shells_available'=>'Наличие папки shell',
	'shells_available_e'=>'Папка и модули внутри нее требуются для отправки через внешние сервера',
	'allow_url_fopen'=>'Межсерверные запросы (allow_url_fopen)',
	'allow_url_fopen_e'=>'Необходимо для работы с внешними серверами и автоматического переноса картинок во вложения',
	'post_max_size'=>'Максимальный размер POST запроса (post_max_size)',
	'post_max_size_e'=>'Ограничивает размер передаваемого письма и вложенных файлов',
	'upload_max_filesize'=>'Максимальный размер прикрепляемого файла (upload_max_filesize)',
	'upload_max_filesize_e'=>'Ограничивает размер прикрепляемых к письму файлов',
	'state_set'=>'Установлены',
	'state_unset'=>'Отсутствуют',
	'state_exist'=>'Присутствует',
	'state_not_exist'=>'Отсутствует',
	'state_allowed'=>'Разрешены',
	'state_not_allowed'=>'Запрещены',
	'refresh'=>'Обновить',

	'UPLOAD_ERR_INI_SIZE'=>'Размер принятого файла превысил максимально допустимый размер, который задан директивой upload_max_filesize конфигурационного файла php.ini.',
	'UPLOAD_ERR_FORM_SIZE'=>'Размер загружаемого файла превысил значение MAX_FILE_SIZE, указанное в HTML-форме.',
	'UPLOAD_ERR_PARTIAL'=>'Загружаемый файл был получен только частично.',
	'UPLOAD_ERR_NO_FILE'=>'Файл не был загружен.',
	'UPLOAD_ERR_NO_TMP_DIR'=>'Отсутствует временная папка.',
	'UPLOAD_ERR_CANT_WRITE'=>'Не удалось записать файл на диск.',
	'UPLOAD_ERR_EXTENSION'=>'PHP-расширение остановило загрузку файла.',
	'UNKNOWN_ERROR'=>'Неизвестная ошибка',

	'transfer-text-in-base64'=>'Передавать текст в base64',

	'save-sended-to-txt-log'=>'Сохранять отправленные в txt лог',
	'insert-test-email-every'=>'Вставлять тестовую почту каждые',
	'insert-test-email-every2'=>'писем',
	'test-email'=>'Тестовая почта',
	'helppage'=>'<h1 style="margin-top: -10px;">FAQ</h1>
<ul>
	<li><a href="#WhatIsIt">Что это?</a></li>
	<li><a href="#HowItWorks">Как это работает?</a></li>
	<li><a href="#WhyYouNeedIt">Зачем нужна йаПосылалка?</a></li>
	<li><a href="#NoEmails">Письма не приходят!</a></li>
	<li><a href="#WhatIsHtmle">Что такое режим html(e)?</a></li>
	<li><a href="#AvailableMacro">Какие макросы доступны?</a></li>
	<li><a href="#MassMailing">Как рассылать много писем?</a></li>
	<li><a href="#WhatIsShell">Что такое шелл?</a></li>
	<li><a href="#WhatIsThreads">Что такое потоки и как их использовать?</a></li>
	<li><a href="#BackgroundSending">Как использовать фоновую рассылку?</a></li>
	<li><a href="#HowSetPassword">Как установить пароль?</a></li>
	<li><a href="#VisualEditorBreakCode">Визуальный редактор портит мой код!</a></li>
	<li><a href="#EmailPersonalization">Как персонализировать письма?</a></li>
	<li><a href="#UseWithImageRandomizer">Как использовать йаПосылалка вместе с Image Randomizer?</a></li>
</ul>
<h3>Статьи на сайте</h3>
<ul>
	<li><a href="http://mailer.a-l-e-x-u-s.ru/articles/how-to-install-alexusmailer-on-server/">Установка йаПосылалка 2.0+ на веб сервера (хостинг, VPS, Dedicated)</a></li>
	<li><a href="http://mailer.a-l-e-x-u-s.ru/articles/using-shells-with-alexusmailer/">Большие почтовые рассылки с помощью йаПосылалка (использование шеллов)</a></li>
	<li><a href="http://mailer.a-l-e-x-u-s.ru/articles/randomizing-images-with-image-randomizer/">Рандомизация изображений в письмах йаПосылалка через Image Randomizer</a></li>
</ul>
<p>
Внимание, за использование данного ПО несете ответственность только Вы. Покупка данного ПО дает вам право на обновления в пределах текущей ветки, поддержку и внесение предложений по доработке.
</p>
<p>
<a name="WhatIsIt"></a><h3>Что это?</h3>
Это скрипт анонимной отправки электронной почты йаПосылалка в текстовом или html формате с возможностью прикрепления файлов. С его помощью вы можете отправить письмо от имени любого отправителя.
</p>
<p>
<a name="HowItWorks"></a><h3>Как это работает?</h3>
йаПосылалка рассылает через SendMail (функция mail() в php), протокол позволяющий отправлять письма не авторизуясь на сервере, это дает возможность доставить письмо от любого почтового ящика. Скрипт написан на PHP5 и для отправки нуждается в наличии SendMail на сервере.
</p>
<p>
<a name="WhyYouNeedIt"></a><h3>Зачем нужна йаПосылалка?</h3>
Для вашего удобства =). Отправка программно очень простая, йаПосылалка обеспечивает удобный интерфейс и инструменты. В ней есть шаблоны писем, макросы, отправка через шеллы (внешние серверы), фоновая отправка.
</p>
<p>
<a name="NoEmails"></a><h3>Письма не приходят!</h3>
В 99% случаев то что письма не приходят зависит от сервера на котором распроложена йаПосылалка или шелла через который они отправляются. 
1. Проверьте наличие SendMail на сервере (например уточните у технической поддержки)
2. Если йаПосылалка рассылает через шеллы убедитесь, что на сервере разрешены сетевые запросы (php команда "echo file_get_contents(\'http://google.com/humans.txt\');" выводит "Google is built by a large team of engineers, designers, researchers...")
3. Проверьте вручную может ли сервер отправлять письма, php команда: mail("тестовый@ящик.ru","тестовое письмо","содержимое тестового письма");
</p>
<p>
<a name="WhatIsHtmle"></a><h3>Что такое режим html(e)?</h3>
Это вариация режима html, где все картинки из тегов <img> и атрибутов background автоматически выкачиваются и превращаются в аттачи письма, таким образом письмо при открытии не обращается в к внешним сайтам. Это позволяет ему мгновенно отображаться в почтовых клиентах и gmail.
</p>
<p>
<a name="AvailableMacro"></a><h3>Какие макросы доступны?</h3>
<table class="table table-striped" width="100%">
    <thead>
        <tr>
            <th>Название</th><th>Формат</th><th>Пример</th><th>Где работает</th></tr>
    </thead>
    <tbody>
        <tr>
            <td>Кому</td><td>[TO-EMAIL]</td><td>[TO-EMAIL]</td><td>Везде кроме поля "Кому"</td></tr>
        <tr>
            <td>От кого, имя</td><td>[FROM-NAME]</td><td>[FROM-NAME]</td><td>Везде кроме поля "От кого, имя"</td></tr>
        <tr>
            <td>От кого, email</td><td>[FROM-EMAIL]</td><td>[FROM-EMAIL]</td><td>Везде кроме поля "От кого, email"</td></tr>
        <tr>
            <td>Адрес ответа</td><td>[REPLY-EMAIL]</td><td>[REPLY-EMAIL]</td><td>Везде кроме поля "Адрес ответа"</td></tr>
        <tr>
            <td>Тема</td><td>[THEME]</td><td>[THEME]</td><td>Везде кроме поля "Тема"</td></tr>
        <tr>
            <td>Допольнительное поле</td><td>[ADD<b>#</b>] где # это номер дополнительного поля считая с 0</td><td>[ADD0]</td><td>Везде кроме соответствующего доп.поля</td></tr>
        <tr>
            <td>Случайное число (5000-6000)</td><td>[RAND]</td><td>[RAND]</td><td>Везде</td></tr>
        <tr>
            <td>Случайное число в диапазоне</td><td>[RAND-<b><i>от</i></b>-<b><i>до</i></b>]</td><td>[RAND-1-10]</td><td>Везде</td></tr>
        <tr>
            <td>Случайный текст (из вариантов)</td><td>[RAND:<b><i>Вариант</i></b><b><i> </i></b><b><i>1</i></b>|<b><i>Вариант</i></b><b><i> </i></b><b><i>2</i></b>|<b><i>И</i></b><b><i> </i></b><b><i>так</i></b><b><i> </i></b><b><i>далее</i></b>]</td><td>[RAND:Привет|Здравствуйте|Приветствую]</td><td>Везде</td></tr>
        <tr>
            <td>Перечисление вариантов текста</td><td>[ENUM:<b><i>Вариант</i></b><b><i> </i></b><b><i>1</i></b>|<b><i>Вариант</i></b><b><i> </i></b><b><i>2</i></b>|<b><i>И</i></b><b><i> </i></b><b><i>так</i></b><b><i> </i></b><b><i>далее</i></b>]</td><td>[ENUM:Первое|Второе|Третье]</td><td>Везде</td></tr>
        <tr>
            <td>Многократное повторение строки</td><td>[(<b><i>Строка</i></b>)*<b>#</b>] где # число сколько раз повторять строку</td><td>[(бе)*3]</td><td>Везде</td></tr>
        <tr>
            <td>Построчный вывод из файла лежащего в папке йаПосылалки</td><td>[FILE:<b><i>имя</i></b><b><i>_</i></b><b><i>файла</i></b><b><i>.txt</i></b>]</td><td>[FILE:jokes.txt]</td><td>Везде</td></tr>
        <tr>
            <td>Построчный вывод из заданного URL</td><td>[URL:<b><i>http://</i></b><b><i>адрес</i></b><b><i>.com</i></b>]</td><td>[URL:http://www.google.com/robots.txt]</td><td>Везде</td></tr>
        <tr>
            <td>Текущая дата</td><td>[DATE] \ [DATE-<b>#</b>] \ [DATE+<b>#</b>] где # количество дней которое надо вычесть или прибавить к текущей дате</td><td>[DATE] [DATE+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущий день</td><td>[DAY] \ [DAY-#] \ [DAY+#] где # количество дней которое надо вычесть или прибавить к текущему дню</td><td>[DAY] [DAY+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущий месяц</td><td>[MONTH] \ [MONTH-#] \ [MONTH+#] где # количество месяцев которое надо вычесть или прибавить к текущему месяцу</td><td>[MONTH] [MONTH+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущий год</td><td>[YEAR] \ [YEAR-#] \ [YEAR+#] где # количество лет которое надо вычесть или прибавить к текущему году</td><td>[YEAR] [YEAR+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущее время</td><td>[TIME] \ [TIME-#] \ [TIME+#] где # количество минут которое надо вычесть или прибавить к текущему времени</td><td>[TIME] [TIME+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущий час</td><td>[HOUR] \ [HOUR-#] \ [HOUR+#] где # количество часов которое надо вычесть или прибавить к текущему часу</td><td>[HOUR] [HOUR+5]</td><td>Везде</td></tr>
        <tr>
            <td>Текущая минута</td><td>[MINUTE] \ [MINUTE-#] \ [MINUTE+#] где # количество минут которое надо вычесть или прибавить к текущей минуте</td><td>[MINUTE] [MINUTE+5]</td><td>Везде</td></tr>
        <tr>
            <td>Используемый шелл</td><td>[OUTSERVER]</td><td>[OUTSERVER]</td><td>Везде, при рассылке через шеллы.</td></tr>
    </tbody>
</table>
Строчные макросы поддерживают вложеность друг в друга и в себя самих. Например [([RAND])*5]

Через макрос [FILE] в поле "Кому", можно организовать отправку писем людям из файла на сервере. А через макрос [URL] разослать письма людям из файла с удаленного сервера.
</p>
<p>
<a name="MassMailing"></a><h3>Как рассылать много писем?</h3>
Для отправки действительно большого количества писем одного сервера становится мало. йаПосылалка предоставляет инструменты для отправки через множество серверов. Управление внешними серверами происходит через шеллы:
<ul>
	<li>wso2 (оригинальная версия с rdot.org)</li>
	<li>ARS (скрипт ремейлер - заменитель шеллов, в поставке скрипта)</li>
	<li>r57</li>
	<li>c99</li>
</ul>
Прописать шеллы можно на соответствующей странице настоек, формат построчный:
<div class="well">Путь к шеллу|тип шелла|пароль от шелла</div>
В тех случаях когда на шелле кроме пароля есть так же логин используется формат
<div class="well">Путь к шеллу|тип шелла|логин от шелла:пароль от шелла</div>
На вкладке настройки внешних серверов доступна быстрая проверка шеллов, она проверяет что адреса корректны, пароли подходят, а сами шеллы выполняют команды.
<br><br>
Если ведется рассылка через шеллы, то с сервера где стоит сама йаПосылалка письма уже не отправляются. Если необходимо отправлять письма и с этого сервера, загрузите на него шелл и добавьте его в список шеллов.
<br><br>
Так же для повышения успешности доставки можно поэксперементировать с параметрами задержки и количеством потоков.
<br><b><span class="diag-bad">Внимание!</span> Для работы с шеллами должна быть загружена папка "shell"</b>
<br><b><span class="diag-bad">Внимание!</span> Модули для работы с r57 и c99 могут детектироваться как вредоносные, в этом случае их лучше не загружать.</b>
</p>
<p>
<a name="WhatIsShell"></a><h3>Что такое шелл?</h3>
Это миниатюрный скрипт облегчающий удаленное управление сервером. Это удобнее для автоматизации множества задач, а так же часто быстрее чем доступ через консоль или по FTP. 
Шелл можно получить скачав один из вариантов из интернета и загрузив на сервер. Или его можно купить, на некоторых форумах продают серверы на которые уже установлен доступ через шеллы.
</p>
<p>
<a name="WhatIsThreads"></a><h3>Что такое потоки и как их использовать</h3>
Потоки это несколько параллельных отправок писем. Предположим у вас есть 8 писем которые надо доставить и 4 потока. Запустив рассылку, каждый поток возьмет себе по письму,(осталось отправить 4) когда какой-нибудь из них закончит доставку он возьмет еще одно (осталось доставить 3), и так далее, пока все письма не будут доставлены.

Задержка влияет на каждый поток по отдельности, тоесть если задержка установлена на 10 секунд, то каждый поток отправив письмо будет ждать 10 секунд.

Внешние сервера берутся поочередно, потому если установить количество потоков равным количеству шеллов вы сможете получить максимальную скорость отправки (но и максимальную смертность шеллов), при таком интенсивном использовании шеллы быстро выйдут из строя. Но этого можно избежать установив достаточно большую задержку.

При фоновой отправке потоки не используется, возможно в будущем это будет изменено.
</p>
<p>
<a name="BackgroundSending"></a><h3>Как использовать фоновую рассылку?</h3>
Включите данную опцию в настройках. Заполните все поля настройки рассылки (кому, доп поля, внешние серверы, задержка) и нажмите кнопку "Отправить", йаПосылалка запустит фоновый процесс отправки на сервере, это произойдет не мгновенно будте терпеливы. Примерно через 5-8 секунд в йаПосылалке начнет обновляться прогресс бар и лог отправки. Если вы обновите страницу или закроете браузер и вернетесь на страницу позже вы обнаружите, что рассылка не прекращалась, а идет на сервере в фоновом режиме. Вы можете остановить рассылку нажав кнопку "Остановить". 
Если сервер на котором находится йаПосылалка будет перезагружен рассылка остановится. В последующих версиях планируется способ автоматического перезапуска фонового процесса.
</p>
<p>
<a name="HowSetPassword"></a><h3>Как установить пароль?</h3>
На вкладке Безопасность в Настройках введите логин и пароль и нажмите "Установить пароль". Чтобы сбросить пароль нажмите "Удалить пароль" или установите пустые логин и пароль.
Так же на этой вкладке доступен параметр HTTP Прокси, которую йаПосылалка может использовать для взаимодействия с шеллами.
</p>
<p>
<a name="VisualEditorBreakCode"></a><h3>Визуальный редактор портит мой код!</h3>
Визуальный редактор пытается валидировать ваш код (делать его верным по всем стандартам), однако иногда это не нужно и наоборот мешает. В этом случае если вы работаете в режиме исходного когда (кнопка "<>"), то нажимая Отправить\Предпросмотр из этого режима, валидации проводиться не будет.
</p>
<p>
<a name="EmailPersonalization"></a><h3>Как персонализировать письма?</h3>
Для персонализации вы можете использовать следующие методы:<br>
1) Указывать получателя в формате: Имя Получателя &lt;почта@получателя.ru&gt;<br>
2) Указывать персональные значения дополнительных полей в строке получателя в формате:
<div class="well">recipient@email.com;ADD0;ADD1;...<br>
или<br>
My Recipient &lt;recipient@email.com&gt;;ADD0;ADD1;...</div>
</p>
<p>
<a name="UseWithImageRandomizer"></a><h3>Как использовать йаПосылалка вместе с Image Randomizer?</h3>
Скрипт можно использовать вместе с рандомизатором изображений <a href="http://imrand.alexuslab.com">Image Randomizer</a>. Для этого можно использовать ссылку напрямую в html тегах для режима Image и макрос йаПосылалка [URL:api link] для режимов "Img тэг" и "Background+css". В первом случае достаточно разместить макрос в нужно местто на странице, а во втором поставить его на место атрибута в нужном теге (например div или table).
</p>
'
));
?>